Revit 2027 API
PointLoad Properties
The PointLoad type exposes the following members.
Properties
Name | Description
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
ForceVector |  The force vector applied to the point load, oriented according to OrientTo setting.
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
HostElementId |  The host element ID for the load.
(Inherited from LoadBase)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsConstrainedOnHost |  The load is constrained to host or not.
(Inherited from LoadBase)
IsHosted |  Indicates if the Load is hosted or non-hosted.
(Inherited from LoadBase)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsReaction |  The load is reaction option.
(Inherited from LoadBase)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
LoadCase |  The load case for the load.
(Inherited from LoadBase)
LoadCaseId |  The load case ID for the load.
(Inherited from LoadBase)
LoadCaseName |  The name of the load case to which this load belongs.
(Inherited from LoadBase)
LoadCategoryName |  The name of the category to which this load belongs.
(Inherited from LoadBase)
LoadNatureName |  A string representing the nature of the load.
(Inherited from LoadBase)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
MomentVector |  The moment vector applied to the point load, oriented according to OrientTo setting.
Name | A human readable name for the Element.
(Inherited from Element)
OrientTo |  The load orientation option.
(Inherited from LoadBase)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
Point |  Returns the position of point load, measured in decimal feet.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorkPlaneId |  Id of the work plane which may determine the orientation of the load.
(Inherited from LoadBase)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
PointLoad Class
Autodesk.Revit.DB.Structure Namespace